-- MySQL dump 10.13  Distrib 5.7.31, for Linux (x86_64)
--
-- Host: 127.0.0.1    Database: vk
-- ------------------------------------------------------
-- Server version	8.0.21-0ubuntu0.20.04.4

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `cities`
--

DROP TABLE IF EXISTS `cities`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `cities` (
  `id` int unsigned NOT NULL AUTO_INCREMENT COMMENT 'Идентификатор строки',
  `country_id` int unsigned DEFAULT NULL,
  `name` varchar(50) NOT NULL COMMENT 'Название города',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT 'Время создания строки',
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT 'Время обновления строки',
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=128 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='Список стран';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `cities`
--

LOCK TABLES `cities` WRITE;
/*!40000 ALTER TABLE `cities` DISABLE KEYS */;
INSERT INTO `cities` VALUES (1,5,'Johnstonview','2020-10-22 15:11:52','2020-10-22 15:19:26'),(2,14,'West Gina','2020-10-22 15:11:52','2020-10-22 15:19:26'),(3,52,'Mayertstad','2020-10-22 15:11:52','2020-10-22 15:19:26'),(4,51,'Boyerside','2020-10-22 15:11:52','2020-10-22 15:19:26'),(5,14,'South Delphine','2020-10-22 15:11:52','2020-10-22 15:19:26'),(6,1,'Lake Arleneville','2020-10-22 15:11:52','2020-10-22 15:19:26'),(7,48,'Margarettechester','2020-10-22 15:11:52','2020-10-22 15:19:26'),(8,68,'North Matteo','2020-10-22 15:11:52','2020-10-22 15:19:26'),(9,26,'Jenkinstown','2020-10-22 15:11:52','2020-10-22 15:19:26'),(10,11,'Hicklemouth','2020-10-22 15:11:52','2020-10-22 15:19:26'),(11,60,'Koelpinstad','2020-10-22 15:11:52','2020-10-22 15:19:26'),(12,14,'South Liamouth','2020-10-22 15:11:52','2020-10-22 15:19:26'),(13,58,'Auerside','2020-10-22 15:11:52','2020-10-22 15:19:26'),(14,80,'Jasttown','2020-10-22 15:11:52','2020-10-22 15:19:26'),(15,57,'Lizaton','2020-10-22 15:11:52','2020-10-22 15:19:26'),(16,44,'Huelmouth','2020-10-22 15:11:52','2020-10-22 15:19:26'),(17,51,'North Bernard','2020-10-22 15:11:52','2020-10-22 15:19:26'),(18,35,'North Tessieburgh','2020-10-22 15:11:52','2020-10-22 15:19:26'),(19,23,'Hectorstad','2020-10-22 15:11:52','2020-10-22 15:19:26'),(20,10,'South Christellehaven','2020-10-22 15:11:52','2020-10-22 15:19:26'),(21,63,'Cummingsfurt','2020-10-22 15:11:52','2020-10-22 15:19:26'),(22,32,'New Urban','2020-10-22 15:11:52','2020-10-22 15:19:26'),(23,57,'Hollyborough','2020-10-22 15:11:52','2020-10-22 15:19:26'),(24,19,'Olenmouth','2020-10-22 15:11:52','2020-10-22 15:19:26'),(25,8,'Kilbacktown','2020-10-22 15:11:52','2020-10-22 15:19:26'),(26,68,'Rollinville','2020-10-22 15:11:52','2020-10-22 15:19:26'),(27,60,'East June','2020-10-22 15:11:52','2020-10-22 15:19:26'),(28,14,'North Danny','2020-10-22 15:11:52','2020-10-22 15:19:26'),(29,58,'Rohanview','2020-10-22 15:11:52','2020-10-22 15:19:26'),(30,79,'South Lynn','2020-10-22 15:11:52','2020-10-22 15:19:26'),(31,53,'Mittieshire','2020-10-22 15:11:52','2020-10-22 15:19:26'),(32,26,'New Ruthieville','2020-10-22 15:11:52','2020-10-22 15:19:26'),(33,54,'South Brockfurt','2020-10-22 15:11:52','2020-10-22 15:19:26'),(34,22,'South Bennettbury','2020-10-22 15:11:52','2020-10-22 15:19:26'),(35,35,'Matildechester','2020-10-22 15:11:52','2020-10-22 15:19:26'),(36,24,'North Guston','2020-10-22 15:11:52','2020-10-22 15:19:26'),(37,15,'New Hulda','2020-10-22 15:11:52','2020-10-22 15:19:26'),(38,1,'East Jesseton','2020-10-22 15:11:52','2020-10-22 15:19:26'),(39,43,'Osinskitown','2020-10-22 15:11:52','2020-10-22 15:19:26'),(40,45,'Elbertmouth','2020-10-22 15:11:52','2020-10-22 15:19:26'),(41,9,'Murraystad','2020-10-22 15:11:52','2020-10-22 15:19:26'),(42,80,'West Marjolaine','2020-10-22 15:11:52','2020-10-22 15:19:26'),(43,35,'Macejkovicmouth','2020-10-22 15:11:52','2020-10-22 15:19:26'),(44,21,'Santinoport','2020-10-22 15:11:52','2020-10-22 15:19:26'),(45,81,'Eichmannbury','2020-10-22 15:11:52','2020-10-22 15:19:26'),(46,5,'Rutherfordmouth','2020-10-22 15:11:52','2020-10-22 15:19:26'),(47,35,'Port Zoila','2020-10-22 15:11:52','2020-10-22 15:19:26'),(48,73,'Sawaynport','2020-10-22 15:11:52','2020-10-22 15:19:26'),(49,10,'Jackieville','2020-10-22 15:11:52','2020-10-22 15:19:26'),(50,80,'East Catherineside','2020-10-22 15:11:52','2020-10-22 15:19:26'),(51,35,'Smithfurt','2020-10-22 15:11:52','2020-10-22 15:19:26'),(52,19,'Port Vivienne','2020-10-22 15:11:52','2020-10-22 15:19:26'),(53,73,'Myriamfort','2020-10-22 15:11:52','2020-10-22 15:19:26'),(54,55,'Schmidtburgh','2020-10-22 15:11:52','2020-10-22 15:19:26'),(55,55,'Herzogport','2020-10-22 15:11:52','2020-10-22 15:19:26'),(56,25,'Hegmannberg','2020-10-22 15:11:52','2020-10-22 15:19:26'),(57,44,'New Bryana','2020-10-22 15:11:52','2020-10-22 15:19:26'),(58,61,'Lake Christiana','2020-10-22 15:11:52','2020-10-22 15:19:26'),(59,4,'Idaburgh','2020-10-22 15:11:52','2020-10-22 15:19:26'),(60,4,'East Kimberlyborough','2020-10-22 15:11:52','2020-10-22 15:19:26'),(61,8,'West Lukas','2020-10-22 15:11:52','2020-10-22 15:19:26'),(62,27,'Larsonside','2020-10-22 15:11:52','2020-10-22 15:19:26'),(63,25,'South Caleightown','2020-10-22 15:11:52','2020-10-22 15:19:26'),(64,44,'Maximusmouth','2020-10-22 15:11:52','2020-10-22 15:19:26'),(65,59,'Laurencestad','2020-10-22 15:11:52','2020-10-22 15:19:26'),(66,82,'Altheaton','2020-10-22 15:11:52','2020-10-22 15:19:26'),(67,61,'Port Rafael','2020-10-22 15:11:52','2020-10-22 15:19:26'),(68,61,'Daughertyport','2020-10-22 15:11:52','2020-10-22 15:19:26'),(69,36,'Jacobsonville','2020-10-22 15:11:52','2020-10-22 15:19:26'),(70,79,'North Lucy','2020-10-22 15:11:52','2020-10-22 15:19:26'),(71,35,'Port Jadyn','2020-10-22 15:11:52','2020-10-22 15:19:26'),(72,24,'Considinechester','2020-10-22 15:11:52','2020-10-22 15:19:26'),(73,14,'New Horaciofort','2020-10-22 15:11:52','2020-10-22 15:19:26'),(74,79,'Evahaven','2020-10-22 15:11:52','2020-10-22 15:19:26'),(75,18,'Lake Nikita','2020-10-22 15:11:52','2020-10-22 15:19:26'),(76,19,'West Leonstad','2020-10-22 15:11:52','2020-10-22 15:19:26'),(77,41,'South Nicklaustown','2020-10-22 15:11:52','2020-10-22 15:19:26'),(78,64,'Morarfurt','2020-10-22 15:11:52','2020-10-22 15:19:26'),(79,30,'New Jonathonshire','2020-10-22 15:11:52','2020-10-22 15:19:26'),(80,40,'South Ervin','2020-10-22 15:11:52','2020-10-22 15:19:26'),(81,25,'Champlinberg','2020-10-22 15:11:52','2020-10-22 15:19:26'),(82,6,'Alyssonton','2020-10-22 15:11:52','2020-10-22 15:19:26'),(83,38,'North Claudeland','2020-10-22 15:11:52','2020-10-22 15:19:26'),(84,3,'North Theodoramouth','2020-10-22 15:11:52','2020-10-22 15:19:26'),(85,70,'West Alec','2020-10-22 15:11:52','2020-10-22 15:19:26'),(86,4,'New Lenore','2020-10-22 15:11:52','2020-10-22 15:19:26'),(87,60,'Mitchellshire','2020-10-22 15:11:52','2020-10-22 15:19:26'),(88,37,'North Xavierborough','2020-10-22 15:11:52','2020-10-22 15:19:26'),(89,2,'Feilmouth','2020-10-22 15:11:52','2020-10-22 15:19:26'),(90,68,'Wunschchester','2020-10-22 15:11:52','2020-10-22 15:19:26'),(91,81,'Lake Harrison','2020-10-22 15:11:52','2020-10-22 15:19:26'),(92,33,'East Vickyfort','2020-10-22 15:11:52','2020-10-22 15:19:26'),(93,5,'Dickinsonbury','2020-10-22 15:11:52','2020-10-22 15:19:26'),(94,11,'New Masonbury','2020-10-22 15:11:52','2020-10-22 15:19:26'),(95,38,'Lake Arno','2020-10-22 15:11:52','2020-10-22 15:19:26'),(96,74,'Huldaside','2020-10-22 15:11:52','2020-10-22 15:19:26'),(97,3,'Jaydahaven','2020-10-22 15:11:52','2020-10-22 15:19:26'),(98,43,'New Chelsey','2020-10-22 15:11:52','2020-10-22 15:19:26'),(99,40,'Jalynfort','2020-10-22 15:11:52','2020-10-22 15:19:26'),(100,69,'Kaelabury','2020-10-22 15:11:52','2020-10-22 15:19:26');
/*!40000 ALTER TABLE `cities` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `communities`
--

DROP TABLE IF EXISTS `communities`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `communities` (
  `id` int unsigned NOT NULL AUTO_INCREMENT COMMENT 'Идентификатор сроки',
  `name` varchar(150) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'Название группы',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT 'Время создание строки',
  `update_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT 'Время обновления строки',
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=21 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='Группы';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `communities`
--

LOCK TABLES `communities` WRITE;
/*!40000 ALTER TABLE `communities` DISABLE KEYS */;
INSERT INTO `communities` VALUES (1,'Aspernatur et.','2014-05-09 03:04:22','2005-12-04 23:37:24'),(2,'Repudiandae ab.','1999-02-18 23:22:15','2002-03-20 20:53:02'),(3,'Similique quisquam.','1975-07-15 11:03:12','1984-05-15 19:42:04'),(4,'Minus et.','1995-11-01 10:34:25','1979-12-22 13:10:43'),(5,'Quas et.','1987-11-28 11:08:29','1971-02-23 08:41:35'),(6,'Qui reprehenderit.','1972-01-30 21:25:24','1995-07-28 20:22:05'),(7,'Officiis aperiam.','2013-12-05 00:51:16','2010-06-15 03:20:08'),(8,'Numquam enim.','1999-09-04 02:45:41','2007-03-06 01:00:04'),(9,'Maxime dolorum id.','1985-06-09 16:45:22','2020-02-27 05:49:12'),(10,'Cum qui.','1975-09-05 11:56:54','2010-12-12 02:32:42'),(11,'Excepturi error.','2003-05-21 21:24:38','2015-02-26 16:13:15'),(12,'Nihil enim vero.','1994-06-20 01:52:43','2018-09-16 19:38:58'),(13,'Qui harum dolor.','1985-05-18 13:14:46','2017-07-15 05:33:48'),(14,'Rerum velit aut.','2007-05-06 21:10:30','1975-07-16 00:43:41'),(15,'Eveniet consequatur libero.','2006-10-25 16:54:28','1980-02-05 05:37:40'),(16,'Est id.','2017-11-18 21:20:39','2008-12-21 06:38:07'),(17,'Itaque magni.','2010-11-04 01:36:27','1999-12-31 07:20:53'),(18,'Autem dolores.','2005-05-31 09:40:01','1983-07-18 10:23:35'),(19,'Omnis reiciendis beatae.','1997-09-30 22:14:52','1987-11-11 01:16:59'),(20,'Et ab enim.','1988-01-12 08:04:25','2009-05-01 04:18:43');
/*!40000 ALTER TABLE `communities` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `communities_users`
--

DROP TABLE IF EXISTS `communities_users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `communities_users` (
  `community_id` int unsigned NOT NULL COMMENT 'Ссылка на группу',
  `user_id` int unsigned NOT NULL COMMENT 'Ссылка на пользователя',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT 'Время создание строки',
  PRIMARY KEY (`community_id`,`user_id`) COMMENT 'Составной первичный ключ'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='Участники групп, связь между пользователями и группами';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `communities_users`
--

LOCK TABLES `communities_users` WRITE;
/*!40000 ALTER TABLE `communities_users` DISABLE KEYS */;
INSERT INTO `communities_users` VALUES (1,23,'1984-10-31 06:39:35'),(2,73,'1974-06-13 03:08:27'),(3,27,'1995-07-09 23:41:07'),(4,46,'1998-02-15 12:02:54'),(5,14,'2012-06-28 09:29:05'),(6,52,'1980-10-01 03:54:31'),(7,25,'2001-06-23 23:35:39'),(8,42,'2010-05-15 01:11:04'),(9,14,'1992-01-12 01:21:42'),(10,90,'1997-03-17 21:18:23'),(11,81,'1977-07-30 00:35:44'),(12,56,'1987-05-15 05:47:54'),(13,85,'1991-03-09 15:10:41'),(14,31,'1975-07-28 12:36:39'),(15,62,'1971-05-29 00:20:17'),(16,38,'1979-11-29 20:11:03'),(17,93,'2014-06-15 03:56:58'),(18,26,'2017-07-19 04:22:27'),(19,19,'1975-08-21 14:58:33'),(20,63,'1989-10-21 21:48:32');
/*!40000 ALTER TABLE `communities_users` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `countries`
--

DROP TABLE IF EXISTS `countries`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `countries` (
  `id` int unsigned NOT NULL AUTO_INCREMENT COMMENT 'Идентификатор строки',
  `name` varchar(50) NOT NULL COMMENT 'Название страны',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT 'Время создания строки',
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT 'Время обновления строки',
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=128 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='Список стран';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `countries`
--

LOCK TABLES `countries` WRITE;
/*!40000 ALTER TABLE `countries` DISABLE KEYS */;
INSERT INTO `countries` VALUES (1,'Latvia','2020-10-22 15:18:02','2020-10-22 15:18:02'),(2,'Australia','2020-10-22 15:18:02','2020-10-22 15:18:02'),(3,'Papua New Guinea','2020-10-22 15:18:02','2020-10-22 15:18:02'),(4,'Chile','2020-10-22 15:18:02','2020-10-22 15:18:02'),(5,'Bangladesh','2020-10-22 15:18:02','2020-10-22 15:18:02'),(6,'Honduras','2020-10-22 15:18:02','2020-10-22 15:18:02'),(7,'Botswana','2020-10-22 15:18:02','2020-10-22 15:18:02'),(8,'Saudi Arabia','2020-10-22 15:18:02','2020-10-22 15:18:02'),(9,'Qatar','2020-10-22 15:18:02','2020-10-22 15:18:02'),(10,'Turkmenistan','2020-10-22 15:18:02','2020-10-22 15:18:02'),(11,'American Samoa','2020-10-22 15:18:02','2020-10-22 15:18:02'),(12,'Sudan','2020-10-22 15:18:02','2020-10-22 15:18:02'),(13,'India','2020-10-22 15:18:02','2020-10-22 15:18:02'),(14,'Israel','2020-10-22 15:18:02','2020-10-22 15:18:02'),(15,'Lithuania','2020-10-22 15:18:02','2020-10-22 15:18:02'),(16,'Ireland','2020-10-22 15:18:02','2020-10-22 15:18:02'),(17,'Korea','2020-10-22 15:18:02','2020-10-22 15:18:02'),(18,'Jordan','2020-10-22 15:18:02','2020-10-22 15:18:02'),(19,'Haiti','2020-10-22 15:18:02','2020-10-22 15:18:02'),(20,'Guam','2020-10-22 15:18:02','2020-10-22 15:18:02'),(21,'French Polynesia','2020-10-22 15:18:02','2020-10-22 15:18:02'),(22,'Vanuatu','2020-10-22 15:18:02','2020-10-22 15:18:02'),(23,'Falkland Islands (Malvinas)','2020-10-22 15:18:02','2020-10-22 15:18:02'),(24,'New Zealand','2020-10-22 15:18:02','2020-10-22 15:18:02'),(25,'Burkina Faso','2020-10-22 15:18:02','2020-10-22 15:18:02'),(26,'Malaysia','2020-10-22 15:18:02','2020-10-22 15:18:02'),(27,'Uruguay','2020-10-22 15:18:02','2020-10-22 15:18:02'),(28,'Denmark','2020-10-22 15:18:02','2020-10-22 15:18:02'),(29,'Bhutan','2020-10-22 15:18:02','2020-10-22 15:18:02'),(30,'Zimbabwe','2020-10-22 15:18:02','2020-10-22 15:18:02'),(31,'Switzerland','2020-10-22 15:18:02','2020-10-22 15:18:02'),(32,'Djibouti','2020-10-22 15:18:02','2020-10-22 15:18:02'),(33,'Sao Tome and Principe','2020-10-22 15:18:02','2020-10-22 15:18:02'),(34,'Samoa','2020-10-22 15:18:02','2020-10-22 15:18:02'),(35,'Germany','2020-10-22 15:18:02','2020-10-22 15:18:02'),(36,'Tajikistan','2020-10-22 15:18:02','2020-10-22 15:18:02'),(37,'Congo','2020-10-22 15:18:02','2020-10-22 15:18:02'),(38,'Saint Barthelemy','2020-10-22 15:18:02','2020-10-22 15:18:02'),(39,'Libyan Arab Jamahiriya','2020-10-22 15:18:02','2020-10-22 15:18:02'),(40,'Syrian Arab Republic','2020-10-22 15:18:02','2020-10-22 15:18:02'),(41,'Timor-Leste','2020-10-22 15:18:02','2020-10-22 15:18:02'),(42,'Dominica','2020-10-22 15:18:02','2020-10-22 15:18:02'),(43,'Lesotho','2020-10-22 15:18:02','2020-10-22 15:18:02'),(44,'Ethiopia','2020-10-22 15:18:02','2020-10-22 15:18:02'),(45,'Central African Republic','2020-10-22 15:18:02','2020-10-22 15:18:02'),(46,'Oman','2020-10-22 15:18:02','2020-10-22 15:18:02'),(47,'Norfolk Island','2020-10-22 15:18:02','2020-10-22 15:18:02'),(48,'Brunei Darussalam','2020-10-22 15:18:02','2020-10-22 15:18:02'),(49,'Bermuda','2020-10-22 15:18:02','2020-10-22 15:18:02'),(50,'Belize','2020-10-22 15:18:02','2020-10-22 15:18:02'),(51,'United States of America','2020-10-22 15:18:02','2020-10-22 15:18:02'),(52,'Iceland','2020-10-22 15:18:02','2020-10-22 15:18:02'),(53,'Guyana','2020-10-22 15:18:02','2020-10-22 15:18:02'),(54,'Togo','2020-10-22 15:18:02','2020-10-22 15:18:02'),(55,'Cape Verde','2020-10-22 15:18:02','2020-10-22 15:18:02'),(56,'Niue','2020-10-22 15:18:02','2020-10-22 15:18:02'),(57,'Maldives','2020-10-22 15:18:02','2020-10-22 15:18:02'),(58,'Namibia','2020-10-22 15:18:02','2020-10-22 15:18:02'),(59,'Wallis and Futuna','2020-10-22 15:18:02','2020-10-22 15:18:02'),(60,'Gambia','2020-10-22 15:18:02','2020-10-22 15:18:02'),(61,'Hong Kong','2020-10-22 15:18:02','2020-10-22 15:18:02'),(62,'Austria','2020-10-22 15:18:02','2020-10-22 15:18:02'),(63,'Cook Islands','2020-10-22 15:18:02','2020-10-22 15:18:02'),(64,'Sweden','2020-10-22 15:18:02','2020-10-22 15:18:02'),(65,'Bosnia and Herzegovina','2020-10-22 15:18:02','2020-10-22 15:18:02'),(66,'South Georgia and the South Sandwich Islands','2020-10-22 15:18:02','2020-10-22 15:18:02'),(67,'Guadeloupe','2020-10-22 15:18:02','2020-10-22 15:18:02'),(68,'Netherlands Antilles','2020-10-22 15:18:02','2020-10-22 15:18:02'),(69,'Turks and Caicos Islands','2020-10-22 15:18:02','2020-10-22 15:18:02'),(70,'Guatemala','2020-10-22 15:18:02','2020-10-22 15:18:02'),(71,'Tanzania','2020-10-22 15:18:02','2020-10-22 15:18:02'),(72,'Egypt','2020-10-22 15:18:02','2020-10-22 15:18:02'),(73,'Tokelau','2020-10-22 15:18:02','2020-10-22 15:18:02'),(74,'Northern Mariana Islands','2020-10-22 15:18:02','2020-10-22 15:18:02'),(75,'Bouvet Island (Bouvetoya)','2020-10-22 15:18:02','2020-10-22 15:18:02'),(76,'Ukraine','2020-10-22 15:18:02','2020-10-22 15:18:02'),(77,'Suriname','2020-10-22 15:18:02','2020-10-22 15:18:02'),(78,'Finland','2020-10-22 15:18:02','2020-10-22 15:18:02'),(79,'Estonia','2020-10-22 15:18:02','2020-10-22 15:18:02'),(80,'Luxembourg','2020-10-22 15:18:02','2020-10-22 15:18:02'),(81,'Slovakia (Slovak Republic)','2020-10-22 15:18:02','2020-10-22 15:18:02'),(82,'Belarus','2020-10-22 15:18:02','2020-10-22 15:18:02'),(83,'Nigeria','2020-10-22 15:18:02','2020-10-22 15:18:02'),(84,'Costa Rica','2020-10-22 15:18:02','2020-10-22 15:18:02');
/*!40000 ALTER TABLE `countries` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `friendship_statuses`
--

DROP TABLE IF EXISTS `friendship_statuses`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `friendship_statuses` (
  `id` int unsigned NOT NULL AUTO_INCREMENT COMMENT 'Идентификатор строки',
  `name` varchar(150) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'Название статуса',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT 'Время создание строки',
  `update_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT 'Время обновления строки',
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='Статусы дружбы';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `friendship_statuses`
--

LOCK TABLES `friendship_statuses` WRITE;
/*!40000 ALTER TABLE `friendship_statuses` DISABLE KEYS */;
INSERT INTO `friendship_statuses` VALUES (1,'not confirmed','1991-11-09 09:51:38','2001-10-25 05:43:37'),(2,'in friends','1996-01-28 23:33:40','2008-10-10 02:38:04');
/*!40000 ALTER TABLE `friendship_statuses` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `friendships`
--

DROP TABLE IF EXISTS `friendships`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `friendships` (
  `user_id` int unsigned NOT NULL COMMENT 'Ссылка на инициатора дружеских отношений',
  `friend_id` int unsigned NOT NULL COMMENT 'Ссылка на получателя приглашения дружить',
  `status_id` int unsigned NOT NULL COMMENT 'Ссылка на статус (текущее состояние) отношений',
  `confirmed_at` datetime DEFAULT NULL COMMENT 'Время подтверждения приглашения',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT 'Время создание строки',
  `update_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT 'Время обновления строки',
  PRIMARY KEY (`user_id`,`friend_id`) COMMENT 'Составной первичгый ключ'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='Таблица дружбы';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `friendships`
--

LOCK TABLES `friendships` WRITE;
/*!40000 ALTER TABLE `friendships` DISABLE KEYS */;
INSERT INTO `friendships` VALUES (1,41,2,'1985-09-30 11:33:48','2006-01-15 13:49:57','1997-01-09 05:24:52'),(2,33,1,'1992-01-24 16:46:53','1990-03-26 06:26:07','2012-01-17 08:39:44'),(3,47,1,'1989-09-19 00:06:59','1970-06-05 22:59:03','2006-09-29 08:01:40'),(4,60,2,'1982-11-11 09:43:34','2011-06-07 00:17:36','1984-07-11 18:56:13'),(5,94,1,'1977-03-11 18:23:23','1999-06-14 07:24:08','2010-06-25 15:13:08'),(6,63,2,'1987-09-29 10:53:04','1988-07-15 09:21:44','2016-12-13 08:48:22'),(7,98,1,'1983-12-14 15:26:13','1994-07-23 02:07:42','1977-09-05 18:16:24'),(8,70,1,'2008-08-12 08:09:25','1985-03-22 15:49:42','2011-02-22 17:39:02'),(9,10,2,'1984-04-26 20:59:28','1970-06-17 17:35:34','1972-04-01 06:25:49'),(10,100,1,'1973-11-07 21:50:31','2018-06-05 19:29:14','1973-05-15 18:11:00'),(11,68,2,'2011-08-11 17:52:32','2015-04-14 08:40:18','1990-05-11 22:58:57'),(12,1,1,'1986-09-01 05:25:51','2014-07-14 21:24:46','1993-11-23 09:34:50'),(13,95,2,'2015-09-19 23:19:14','1974-04-10 22:07:40','2017-06-03 23:30:22'),(14,5,1,'2018-06-16 23:54:23','2015-05-30 21:24:34','2005-09-16 08:27:45'),(15,90,2,'1991-05-31 22:23:01','1971-02-08 05:45:55','2011-08-21 18:54:43'),(16,14,2,'1972-02-27 09:30:53','2016-05-18 01:57:42','1986-03-15 07:55:37'),(17,91,2,'1971-03-11 17:14:36','1985-10-11 09:43:23','1994-06-07 13:48:06'),(18,7,2,'1997-04-10 23:31:24','1993-06-13 04:17:03','1982-03-12 10:15:13'),(19,12,2,'1990-02-16 02:50:09','1974-06-22 16:50:07','1979-09-26 02:44:58'),(20,57,1,'1974-07-05 18:38:00','1999-06-30 02:20:25','1993-06-08 10:09:15'),(21,25,1,'1973-07-29 12:01:14','1987-02-21 22:38:50','1970-02-10 23:45:10'),(22,4,2,'2005-10-11 02:41:29','2010-10-12 02:41:22','1981-10-26 08:27:36'),(23,93,2,'1986-07-21 23:41:44','2005-11-12 09:51:00','1976-02-27 04:24:17'),(24,90,1,'2009-02-15 06:56:49','1984-09-29 03:57:37','2006-10-09 23:37:20'),(25,63,2,'2020-04-20 16:50:10','1981-01-18 03:08:52','2018-03-31 23:50:09'),(26,50,2,'2000-04-18 06:32:14','1997-12-16 03:23:53','2019-11-14 23:17:28'),(27,35,2,'2012-10-12 15:32:27','1991-06-11 05:27:45','1981-07-22 07:12:50'),(28,79,2,'2018-05-31 22:04:07','1973-08-19 01:36:21','1996-06-15 08:32:30'),(29,9,2,'1973-01-10 01:10:24','2012-08-31 14:35:58','1986-09-30 20:08:31'),(30,91,1,'2003-07-04 21:59:57','2020-06-20 05:23:29','2008-06-20 13:40:31'),(31,49,2,'1981-03-01 05:26:18','1986-12-05 05:30:39','1975-07-14 19:12:43'),(32,49,1,'2003-09-06 21:21:55','2001-02-07 10:35:40','1998-11-15 16:36:29'),(33,23,2,'1977-02-24 01:50:41','1970-07-15 03:00:48','2012-10-17 23:41:37'),(34,95,2,'2015-03-28 04:49:24','1995-03-29 07:26:23','2018-04-01 19:13:00'),(35,9,2,'2000-06-06 02:35:41','2016-02-13 01:51:18','1975-12-31 18:57:20'),(36,17,1,'2008-04-11 06:19:08','2013-04-09 21:46:39','2001-05-14 09:30:55'),(37,57,2,'1994-12-08 07:28:04','2008-12-09 07:41:40','2013-03-20 08:01:49'),(38,7,1,'1983-12-01 17:27:38','2008-07-25 07:59:57','2019-07-03 11:43:13'),(39,87,1,'1981-03-10 19:46:57','1984-04-24 10:08:38','1974-06-14 00:48:39'),(40,67,2,'1986-01-24 19:05:54','2004-10-05 00:58:04','1983-04-30 13:18:11'),(41,6,1,'2012-05-14 03:11:40','1995-09-01 05:21:41','2011-02-12 00:53:36'),(42,54,1,'1972-12-07 12:16:50','1980-11-10 02:45:37','1972-09-15 03:58:25'),(43,68,1,'1973-02-27 08:00:26','1983-11-12 09:47:35','2009-12-13 15:19:46'),(44,100,2,'2019-04-03 15:31:00','1987-03-23 07:33:00','1971-12-30 16:25:12'),(45,59,1,'1993-03-19 17:14:34','1986-04-16 15:17:06','2005-09-07 14:05:42'),(46,57,2,'1986-06-13 05:39:29','1995-06-27 08:22:19','2004-02-06 14:27:26'),(47,13,2,'1983-10-28 07:38:09','1987-12-08 06:36:45','1976-01-03 10:57:02'),(48,49,1,'1972-12-14 16:17:41','2014-07-27 10:04:37','2013-05-11 20:49:28'),(49,63,1,'1990-11-09 11:00:13','1977-12-17 02:56:00','1992-03-24 11:57:37'),(50,25,1,'1993-09-20 10:28:44','2012-11-12 08:26:25','2015-02-23 08:21:07'),(51,6,1,'2010-02-02 09:10:52','1974-04-05 07:26:24','1978-10-03 03:15:56'),(52,88,1,'1979-07-31 08:13:52','1982-03-02 16:59:50','1974-11-25 03:21:56'),(53,28,1,'1975-11-29 12:12:18','1978-03-03 02:18:50','1979-01-17 00:24:41'),(54,99,2,'2014-04-20 21:26:10','1978-11-09 17:15:02','1990-07-28 02:03:20'),(55,77,1,'1989-04-13 00:59:55','1974-11-05 17:43:15','1988-06-14 03:39:21'),(56,91,2,'1975-03-14 01:50:10','1995-05-22 10:07:46','1983-10-06 14:20:27'),(57,49,2,'2018-06-04 12:16:30','1997-07-16 06:59:27','1974-12-23 13:40:55'),(58,12,2,'2018-04-10 23:21:16','1985-03-04 08:07:12','1987-10-03 16:17:37'),(59,69,1,'1985-01-14 17:22:48','2010-03-16 06:02:26','2017-03-21 05:05:03'),(60,57,2,'2014-09-30 21:33:57','1997-09-08 13:54:14','2018-07-12 19:04:53'),(61,2,1,'1994-08-11 12:53:35','1970-03-18 15:35:06','1988-09-13 23:49:26'),(62,18,2,'2007-05-11 23:46:33','2005-07-10 21:53:29','1974-05-07 08:32:16'),(63,6,1,'2020-04-19 05:21:30','2004-06-18 16:30:21','1972-04-07 22:42:32'),(64,25,1,'1971-02-23 02:06:09','2000-03-13 22:31:44','1983-05-23 15:32:11'),(65,12,2,'2015-11-03 20:53:41','1998-02-05 13:31:27','1999-09-17 14:22:14'),(66,14,2,'1984-07-04 06:31:05','2009-02-21 15:01:31','1989-10-24 13:23:36'),(67,42,2,'1988-06-14 07:37:22','2013-07-07 20:15:38','1992-04-01 14:51:01'),(68,69,1,'2018-09-12 16:11:26','1974-04-01 16:00:05','1994-07-09 05:07:01'),(69,20,1,'2019-02-12 12:35:33','2015-11-03 01:29:52','1985-03-28 06:37:52'),(70,28,1,'2005-05-02 21:46:11','1990-04-21 10:50:22','1986-08-20 08:44:45'),(71,35,1,'1998-06-06 16:33:28','1970-07-23 08:22:28','1971-06-09 03:08:21'),(72,26,2,'2008-09-25 22:08:32','1973-05-01 23:38:33','1992-11-09 21:21:00'),(73,82,2,'1997-12-30 20:48:46','2001-06-08 06:03:06','1970-07-26 13:24:08'),(74,2,1,'1975-06-02 00:38:11','2008-01-16 12:47:00','2015-01-08 04:19:41'),(75,26,2,'1998-07-14 08:08:57','1987-10-17 19:39:53','2017-07-25 10:23:51'),(76,40,2,'2007-06-12 02:58:49','2017-04-10 02:49:41','1980-04-23 17:12:52'),(77,58,1,'1984-01-08 13:40:02','1997-10-20 11:47:32','2014-06-20 07:54:56'),(78,38,2,'2019-09-23 20:53:56','2007-04-03 23:34:14','1982-12-10 17:45:23'),(79,89,2,'1992-06-18 01:54:08','1973-06-13 07:05:45','1979-01-10 06:12:36'),(80,21,1,'1980-08-07 08:05:57','1978-04-15 04:38:20','2013-03-16 05:21:34'),(81,62,1,'2006-02-17 21:59:25','2011-11-06 00:12:38','2014-12-02 22:48:24'),(82,94,1,'1989-07-12 03:26:41','2001-10-19 04:43:03','1972-09-24 04:01:22'),(83,8,1,'2006-09-21 14:55:08','2008-11-03 23:42:53','1986-07-25 04:06:20'),(84,90,1,'2018-08-27 13:19:17','1994-05-08 09:46:36','2015-10-12 15:46:58'),(85,92,2,'1984-10-05 16:13:06','1985-01-25 13:20:21','2015-02-16 03:50:11'),(86,85,2,'1992-11-11 01:36:58','2010-11-17 01:21:20','1989-09-11 15:26:22'),(87,81,1,'2018-02-18 15:20:15','2004-05-06 03:45:12','1998-06-24 18:56:38'),(88,41,1,'1998-06-02 16:13:37','2014-02-15 11:44:14','1973-12-31 06:42:53'),(89,96,2,'1992-01-12 17:59:05','1975-11-22 11:34:02','2015-12-15 12:50:29'),(90,50,2,'1988-10-16 23:06:30','1980-07-22 17:55:27','2014-11-29 12:13:50'),(91,97,1,'1999-05-10 07:38:38','1974-04-28 13:17:18','2000-10-23 07:07:34'),(92,98,1,'2002-08-12 06:06:26','1987-04-11 10:04:07','2005-07-25 13:02:14'),(93,67,1,'1987-10-11 20:43:44','2019-10-18 10:55:00','2012-03-10 04:47:52'),(94,3,2,'1992-05-09 12:44:30','1988-09-27 17:02:54','2004-05-04 20:43:28'),(95,22,2,'1992-09-15 01:56:53','1981-01-24 16:28:10','2015-02-18 17:53:48'),(96,78,2,'1982-04-27 08:15:48','1998-01-11 09:38:22','1972-10-17 01:14:47'),(97,17,2,'2019-01-22 11:57:11','2019-10-21 08:44:59','1987-05-20 15:00:10'),(98,64,1,'1982-02-20 10:41:30','1978-09-14 01:11:02','1988-11-12 14:52:56'),(99,47,1,'1985-04-21 08:26:37','2003-07-14 18:06:21','2019-01-12 20:28:30'),(100,37,2,'2014-03-16 17:34:25','2019-09-18 20:36:16','2012-06-24 21:33:46');
/*!40000 ALTER TABLE `friendships` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `media`
--

DROP TABLE IF EXISTS `media`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `media` (
  `id` int unsigned NOT NULL AUTO_INCREMENT COMMENT 'Идентификатор строки',
  `user_id` int unsigned NOT NULL COMMENT 'Ссылка на пользователя, который загрузил файл',
  `filename` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'Путь к файлу',
  `size` int NOT NULL COMMENT 'Размер файла',
  `metadata` json DEFAULT NULL,
  `media_type_id` int unsigned NOT NULL COMMENT 'Ссылка на тип контента',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT 'Время создание строки',
  `update_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT 'Время обновления строки',
  PRIMARY KEY (`id`),
  CONSTRAINT `media_chk_1` CHECK (json_valid(`metadata`))
) ENGINE=InnoDB AUTO_INCREMENT=69 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='Медиафайлы';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `media`
--

LOCK TABLES `media` WRITE;
/*!40000 ALTER TABLE `media` DISABLE KEYS */;
INSERT INTO `media` VALUES (1,53,'http://dropbox.net/vk/Koss.mpeg4',95965,'{\"owner\": \"Coty Zemlak\"}',1,'1979-01-08 15:45:33','2020-10-22 15:59:28'),(2,76,'http://dropbox.net/vk/McDermott.mp3',22326,'{\"owner\": \"Anissa Rau\"}',2,'1996-05-14 07:07:11','2020-10-22 15:59:28'),(3,27,'http://dropbox.net/vk/Armstrong.mp3',528724310,'{\"owner\": \"Herman Hintz\"}',3,'1975-05-12 04:12:53','2020-10-22 15:59:28'),(4,73,'http://dropbox.net/vk/Funk.jpeg',483584863,'{\"owner\": \"Amber Legros\"}',1,'1996-11-16 23:52:13','2020-10-22 15:59:28'),(5,4,'http://dropbox.net/vk/Blick.png',831741417,'{\"owner\": \"Walter Simonis\"}',2,'2013-06-11 12:17:50','2020-10-22 15:59:28'),(6,95,'http://dropbox.net/vk/Schiller.png',3677611,'{\"owner\": \"Keely Emmerich\"}',3,'1998-09-21 08:34:09','2020-10-22 15:59:28'),(7,86,'http://dropbox.net/vk/Frami.png',15467180,'{\"owner\": \"Adrianna Koelpin\"}',1,'1979-02-25 00:30:22','2020-10-22 15:59:28'),(8,84,'http://dropbox.net/vk/Boyer.mp3',707942528,'{\"owner\": \"Erik Klocko\"}',2,'1972-05-03 23:34:34','2020-10-22 15:59:28'),(9,26,'http://dropbox.net/vk/Trantow.png',1375,'{\"owner\": \"Hannah Schamberger\"}',3,'2001-04-20 02:57:32','2020-10-22 15:59:28'),(10,20,'http://dropbox.net/vk/Glover.png',44478420,'{\"owner\": \"Matilde Stark\"}',1,'2002-02-16 06:07:53','2020-10-22 15:59:28'),(11,44,'http://dropbox.net/vk/Crist.mp3',4693189,'{\"owner\": \"Anais Denesik\"}',2,'2000-08-05 09:09:33','2020-10-22 15:59:28'),(12,45,'http://dropbox.net/vk/Hartmann.mpeg4',565157,'{\"owner\": \"Justus Wolf\"}',3,'2005-01-24 07:50:06','2020-10-22 15:59:28'),(13,40,'http://dropbox.net/vk/Mitchell.mpeg4',98554547,'{\"owner\": \"Carmelo Sauer\"}',1,'1995-09-09 06:31:36','2020-10-22 15:59:28'),(14,88,'http://dropbox.net/vk/Koss.mp3',359327506,'{\"owner\": \"Jordan Labadie\"}',2,'2008-06-08 00:06:41','2020-10-22 15:59:28'),(15,1,'http://dropbox.net/vk/Rempel.png',500963918,'{\"owner\": \"Amy Carroll\"}',3,'2005-12-05 11:03:14','2020-10-22 15:59:28'),(16,55,'http://dropbox.net/vk/Dickinson.jpeg',426827106,'{\"owner\": \"Orlando Olson\"}',1,'2004-09-22 19:03:10','2020-10-22 15:59:28'),(17,49,'http://dropbox.net/vk/Funk.jpeg',631233806,'{\"owner\": \"Melba Doyle\"}',2,'2012-04-18 22:21:40','2020-10-22 15:59:28'),(18,97,'http://dropbox.net/vk/Zemlak.mpeg4',63750,'{\"owner\": \"Bonnie Swaniawski\"}',3,'2010-12-08 02:08:32','2020-10-22 15:59:28'),(19,50,'http://dropbox.net/vk/Glover.png',2068,'{\"owner\": \"Augusta Runolfsdottir\"}',1,'2018-09-22 01:58:42','2020-10-22 15:59:28'),(20,29,'http://dropbox.net/vk/Smith.mp3',2297,'{\"owner\": \"Barry Adams\"}',2,'2009-09-26 21:46:22','2020-10-22 15:59:28'),(21,12,'http://dropbox.net/vk/Corwin.png',6489115,'{\"owner\": \"Percival Kiehn\"}',3,'1997-07-09 14:19:53','2020-10-22 15:59:28'),(22,93,'http://dropbox.net/vk/Hartmann.mpeg4',67218,'{\"owner\": \"Rasheed Schiller\"}',1,'1976-01-31 21:54:01','2020-10-22 15:59:28'),(23,44,'http://dropbox.net/vk/Schmitt.png',29399,'{\"owner\": \"Anais Denesik\"}',2,'1985-12-22 22:02:32','2020-10-22 15:59:28'),(24,66,'http://dropbox.net/vk/Legros.png',945514149,'{\"owner\": \"Hank Mills\"}',3,'1994-06-09 13:46:36','2020-10-22 15:59:28'),(25,15,'http://dropbox.net/vk/Haley.jpeg',272562,'{\"owner\": \"Arely Cronin\"}',1,'1972-07-18 08:14:53','2020-10-22 15:59:28'),(26,88,'http://dropbox.net/vk/Wiza.mp3',9939545,'{\"owner\": \"Jordan Labadie\"}',2,'2018-11-13 13:20:08','2020-10-22 15:59:28'),(27,61,'http://dropbox.net/vk/Satterfield.mpeg4',252262711,'{\"owner\": \"Jermaine Harber\"}',3,'2013-10-22 13:02:48','2020-10-22 15:59:28'),(28,51,'http://dropbox.net/vk/Koelpin.jpeg',875677745,'{\"owner\": \"Patience Koss\"}',1,'2016-06-06 17:37:30','2020-10-22 15:59:28'),(29,66,'http://dropbox.net/vk/Schamberger.mp3',484677336,'{\"owner\": \"Hank Mills\"}',2,'1989-09-19 17:45:33','2020-10-22 15:59:28'),(30,99,'http://dropbox.net/vk/Adams.mp3',796343475,'{\"owner\": \"Danyka Hackett\"}',3,'2016-10-27 00:21:19','2020-10-22 15:59:28'),(31,75,'http://dropbox.net/vk/Sauer.mp3',26290,'{\"owner\": \"Tristin Satterfield\"}',1,'2015-07-25 07:45:34','2020-10-22 15:59:28'),(32,19,'http://dropbox.net/vk/Funk.jpeg',527675401,'{\"owner\": \"Rose Howell\"}',2,'1979-03-10 11:21:10','2020-10-22 15:59:28'),(33,74,'http://dropbox.net/vk/Schmitt.mp3',2465,'{\"owner\": \"Rhianna Kuphal\"}',3,'1991-07-08 04:52:42','2020-10-22 15:59:28'),(34,2,'http://dropbox.net/vk/Koss.mpeg4',249336610,'{\"owner\": \"Kiara Bernhard\"}',1,'1990-05-10 15:58:14','2020-10-22 15:59:28'),(35,91,'http://dropbox.net/vk/Schamberger.jpeg',83381319,'{\"owner\": \"Kraig Boyer\"}',2,'1971-11-18 06:31:22','2020-10-22 15:59:28'),(36,78,'http://dropbox.net/vk/Kiehn.mp3',24162,'{\"owner\": \"Morton Deckow\"}',3,'1992-03-26 15:31:28','2020-10-22 15:59:28'),(37,96,'http://dropbox.net/vk/Prosacco.jpeg',663646877,'{\"owner\": \"Nikita Corwin\"}',1,'2009-12-23 05:54:25','2020-10-22 15:59:28'),(38,77,'http://dropbox.net/vk/Blanda.jpeg',570214589,'{\"owner\": \"Carole Gusikowski\"}',2,'2013-05-10 02:04:01','2020-10-22 15:59:28'),(39,61,'http://dropbox.net/vk/Zemlak.png',45868,'{\"owner\": \"Jermaine Harber\"}',3,'1992-10-24 05:41:50','2020-10-22 15:59:28'),(40,21,'http://dropbox.net/vk/Koelpin.mpeg4',66815,'{\"owner\": \"Aiden Frami\"}',1,'2012-10-07 19:19:20','2020-10-22 15:59:28'),(41,96,'http://dropbox.net/vk/Fadel.png',860122342,'{\"owner\": \"Nikita Corwin\"}',2,'2007-03-07 07:06:24','2020-10-22 15:59:28'),(42,4,'http://dropbox.net/vk/Satterfield.mpeg4',3847,'{\"owner\": \"Walter Simonis\"}',3,'2001-07-22 18:13:44','2020-10-22 15:59:28'),(43,66,'http://dropbox.net/vk/Hackett.png',54605086,'{\"owner\": \"Hank Mills\"}',1,'1985-10-05 07:53:34','2020-10-22 15:59:28'),(44,35,'http://dropbox.net/vk/Mitchell.png',822461,'{\"owner\": \"Rey Raynor\"}',2,'1976-12-01 03:59:31','2020-10-22 15:59:28'),(45,92,'http://dropbox.net/vk/Bartell.jpeg',589957977,'{\"owner\": \"Vernon Rempel\"}',3,'1971-02-25 21:56:33','2020-10-22 15:59:28'),(46,66,'http://dropbox.net/vk/Glover.mp3',68725752,'{\"owner\": \"Hank Mills\"}',1,'1984-01-07 19:02:23','2020-10-22 15:59:28'),(47,90,'http://dropbox.net/vk/Sauer.png',369412890,'{\"owner\": \"Erich Kerluke\"}',2,'2013-03-03 16:16:21','2020-10-22 15:59:28'),(48,40,'http://dropbox.net/vk/Gusikowski.mpeg4',77180549,'{\"owner\": \"Carmelo Sauer\"}',3,'1973-03-17 09:00:38','2020-10-22 15:59:28'),(49,63,'http://dropbox.net/vk/Hintz.jpeg',277654109,'{\"owner\": \"Zaria Von\"}',1,'1998-11-25 03:49:23','2020-10-22 15:59:28'),(50,40,'http://dropbox.net/vk/McDermott.mp3',207948,'{\"owner\": \"Carmelo Sauer\"}',2,'1990-07-20 11:58:58','2020-10-22 15:59:28'),(51,69,'http://dropbox.net/vk/Hartmann.mpeg4',922507,'{\"owner\": \"Verona Cruickshank\"}',3,'1992-06-15 00:10:25','2020-10-22 15:59:28'),(52,75,'http://dropbox.net/vk/Wolf.mpeg4',156718927,'{\"owner\": \"Tristin Satterfield\"}',1,'1975-02-17 06:58:05','2020-10-22 15:59:28'),(53,33,'http://dropbox.net/vk/Gleichner.mp3',10027,'{\"owner\": \"Skylar Bechtelar\"}',2,'1993-10-05 10:42:30','2020-10-22 15:59:28'),(54,13,'http://dropbox.net/vk/Olson.mp3',950622338,'{\"owner\": \"Oswaldo Braun\"}',3,'2002-12-02 12:59:53','2020-10-22 15:59:28'),(55,40,'http://dropbox.net/vk/Hessel.png',800549447,'{\"owner\": \"Carmelo Sauer\"}',1,'1985-10-07 22:08:39','2020-10-22 15:59:28'),(56,48,'http://dropbox.net/vk/Kuphal.mpeg4',5654,'{\"owner\": \"Rosa Schmitt\"}',2,'2016-03-10 23:22:58','2020-10-22 15:59:28'),(57,100,'http://dropbox.net/vk/Stark.png',9798467,'{\"owner\": \"Haylee Ortiz\"}',3,'1988-09-14 00:21:18','2020-10-22 15:59:28'),(58,1,'http://dropbox.net/vk/Kilback.mpeg4',282944940,'{\"owner\": \"Amy Carroll\"}',1,'2015-08-03 07:23:53','2020-10-22 15:59:28'),(59,98,'http://dropbox.net/vk/Doyle.png',384241899,'{\"owner\": \"Richard Haley\"}',2,'2008-03-12 23:47:02','2020-10-22 15:59:28'),(60,66,'http://dropbox.net/vk/Funk.mpeg4',562847719,'{\"owner\": \"Hank Mills\"}',3,'1994-11-04 14:10:06','2020-10-22 15:59:28'),(61,99,'http://dropbox.net/vk/Klocko.mp3',618017,'{\"owner\": \"Danyka Hackett\"}',1,'1975-05-15 16:08:20','2020-10-22 15:59:28'),(62,73,'http://dropbox.net/vk/Koss.mpeg4',965393806,'{\"owner\": \"Amber Legros\"}',2,'2012-08-02 13:32:39','2020-10-22 15:59:28'),(63,84,'http://dropbox.net/vk/Blanda.png',376141,'{\"owner\": \"Erik Klocko\"}',3,'1973-03-20 21:15:44','2020-10-22 15:59:28'),(64,73,'http://dropbox.net/vk/Rau.png',138415903,'{\"owner\": \"Amber Legros\"}',1,'1980-06-29 07:44:27','2020-10-22 15:59:28'),(65,75,'http://dropbox.net/vk/Rau.jpeg',795888128,'{\"owner\": \"Tristin Satterfield\"}',2,'1996-01-07 23:59:55','2020-10-22 15:59:28'),(66,75,'http://dropbox.net/vk/Klocko.png',5700,'{\"owner\": \"Tristin Satterfield\"}',3,'2014-11-28 16:16:12','2020-10-22 15:59:28'),(67,50,'http://dropbox.net/vk/Kiehn.mpeg4',4707,'{\"owner\": \"Augusta Runolfsdottir\"}',1,'2006-02-24 09:51:17','2020-10-22 15:59:28'),(68,70,'http://dropbox.net/vk/Reichel.mpeg4',59976,'{\"owner\": \"Arielle Wolf\"}',2,'1971-01-10 07:12:21','2020-10-22 15:59:28');
/*!40000 ALTER TABLE `media` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `media_types`
--

DROP TABLE IF EXISTS `media_types`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `media_types` (
  `id` int unsigned NOT NULL AUTO_INCREMENT COMMENT 'Идентификатор строки',
  `name` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'Название типа',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT 'Время создание строки',
  `update_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT 'Время обновления строки',
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='Типы медиафайлов';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `media_types`
--

LOCK TABLES `media_types` WRITE;
/*!40000 ALTER TABLE `media_types` DISABLE KEYS */;
INSERT INTO `media_types` VALUES (1,'pictures','1970-05-01 01:36:47','2019-08-14 20:24:06'),(2,'video','1992-09-13 03:25:00','1997-01-15 03:15:23'),(3,'audio','1994-04-12 21:35:22','1978-08-06 13:41:59');
/*!40000 ALTER TABLE `media_types` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `messages`
--

DROP TABLE IF EXISTS `messages`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `messages` (
  `id` int unsigned NOT NULL AUTO_INCREMENT COMMENT 'Идентификатор строки',
  `from_user_id` int unsigned NOT NULL COMMENT 'Ссылка на отправителя',
  `to_user_id` int unsigned NOT NULL COMMENT 'Ссылка на получателя сообщения',
  `body` text CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'Текст сообщения',
  `is_impotant` tinyint(1) DEFAULT NULL COMMENT 'Признак важности',
  `is_delivered` tinyint(1) DEFAULT NULL COMMENT 'Признак доставки',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT 'Время создание строки',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=71 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='Сообщения';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `messages`
--

LOCK TABLES `messages` WRITE;
/*!40000 ALTER TABLE `messages` DISABLE KEYS */;
INSERT INTO `messages` VALUES (1,1,86,'Quo modi maxime qui rerum et commodi nemo. Quaerat nesciunt error est consequatur cum quae nulla. Impedit fugit reprehenderit dolore quis sunt dolor.',0,0,'1991-05-08 19:38:43'),(2,2,78,'Iusto architecto necessitatibus earum at. Quas nobis quo autem quia.',0,0,'1978-02-24 04:41:05'),(3,3,9,'Debitis earum voluptas dicta ratione vero neque odio. Consequatur doloremque quisquam voluptas eveniet. Soluta nulla omnis id vero alias illum voluptas. Qui qui aperiam officia.',0,1,'1970-10-21 05:29:54'),(4,4,64,'Minima consequatur aperiam numquam fuga rerum est at. Aliquam minus ut optio voluptatum ipsam pariatur accusantium et. Vel et dolorem sapiente neque.',0,0,'1987-06-20 22:57:39'),(5,5,27,'Quia similique qui minima eaque eaque amet qui ipsum. Velit sit quis id dolor. Error optio inventore aliquam libero molestias. Beatae sunt facere sint cumque et.',0,0,'1992-03-25 03:09:28'),(6,6,64,'Id cumque ut quibusdam ex numquam nam. Repellendus nobis omnis pariatur omnis quia eaque quia corporis. Et culpa minus autem molestias. Numquam est odio culpa praesentium qui.',0,1,'2013-08-20 12:15:06'),(7,7,91,'Aut tenetur at totam quo qui odio eos. Saepe error inventore illo in doloremque. Saepe iste vitae tempora esse suscipit voluptas.',1,1,'2014-09-24 01:57:27'),(8,8,75,'Praesentium et repellat deleniti quo. Alias architecto quia odio eos aspernatur vero. Sit consequuntur nisi iste omnis facilis.',1,0,'1978-02-20 23:24:04'),(9,9,91,'Voluptatum aut earum tenetur ad. Impedit laboriosam possimus id voluptas nemo soluta reiciendis corporis. Voluptas eligendi perspiciatis quo a.',1,1,'2013-08-06 15:26:42'),(10,10,8,'Quas modi provident provident numquam ipsa ex. Repellat explicabo eum qui quam et sed possimus. Dolor et rem nulla non.',1,0,'2013-11-22 15:59:22'),(11,11,38,'Deleniti officiis velit dolor soluta et. Voluptatem architecto et quia eveniet earum. Nemo amet doloribus aspernatur commodi culpa.',0,1,'2007-09-14 17:13:29'),(12,12,73,'Enim nobis sint eaque sint qui. Rerum saepe sit dolorem earum illum. Voluptas consequatur laborum ducimus eum voluptate. Dolor eius et accusantium modi nemo.',1,0,'1987-04-04 01:54:14'),(13,13,97,'Est assumenda iure tempora aut dignissimos. Est sapiente asperiores sunt suscipit. Iure aut mollitia sit consequatur similique. Aut ut officiis explicabo asperiores saepe maiores.',0,1,'1970-05-18 15:51:25'),(14,14,74,'Nihil omnis aut rerum eum est. Similique beatae eos natus et rerum similique. Aliquid consequatur nihil praesentium dolorum quaerat doloribus accusantium sed.',0,1,'1994-03-15 03:53:06'),(15,15,79,'Et ea et quis mollitia sint mollitia autem. Quae tempora aspernatur sit pariatur. Dolore molestias quis enim mollitia eos harum. Accusamus est vitae iure qui.',0,1,'2020-09-18 06:49:49'),(16,16,45,'Suscipit unde eveniet qui quia voluptatibus non. Dolor quo adipisci et tenetur. Blanditiis consectetur voluptas temporibus delectus.',1,1,'1990-05-16 10:34:05'),(17,17,48,'Nihil et libero at assumenda et qui. Magnam unde velit nulla sit nobis. Exercitationem quos qui beatae est.',1,0,'1995-04-25 18:01:57'),(18,18,62,'Quis autem quod quia itaque sunt est non. Iure tenetur nam natus explicabo minus qui. Voluptatem quia fuga iure amet.',1,0,'2011-10-23 02:44:47'),(19,19,38,'Velit quia atque suscipit est quis sint. Tenetur laboriosam aliquid commodi rerum amet quidem nihil. Reiciendis saepe fuga dolorem cumque deserunt quos et.',1,0,'1995-11-30 09:21:07'),(20,20,79,'Et doloribus eligendi delectus rem sunt soluta unde. Delectus quisquam quo velit minus et nemo. Dolor doloribus consequuntur repellat sit debitis.',1,0,'1988-04-01 20:28:43'),(21,21,28,'Ea aut dolor qui. Cupiditate voluptatem porro animi blanditiis reiciendis.',0,1,'2007-09-08 06:29:49'),(22,22,1,'Consectetur aliquid atque velit dolor voluptatibus dolorum. Porro vitae sit quae. Et voluptate placeat porro sunt.',0,0,'1986-11-17 17:00:07'),(23,23,53,'Sint blanditiis et eum harum ut. Voluptatem incidunt eos ea vel maxime earum amet. Beatae impedit eaque cum architecto. Harum praesentium non quasi sequi ea.',1,1,'1992-01-12 12:44:27'),(24,24,64,'Ullam inventore eveniet porro molestias alias. Sequi doloribus ea mollitia odio neque. Autem nisi non suscipit. Velit amet quaerat fugit.',1,0,'1987-03-05 17:45:18'),(25,25,46,'Iste vero optio voluptatem vitae. Voluptate ipsum provident sit odio dolorem. Cupiditate praesentium consequatur quia ea. Commodi doloribus eligendi et vero nesciunt neque.',1,0,'2013-10-12 21:34:47'),(26,26,93,'Ducimus maxime nulla enim excepturi. Id fugit maiores magnam fugiat accusamus est. Et nihil hic corrupti veniam veritatis facilis. Velit nulla rem qui ut.',1,0,'2006-06-17 19:54:25'),(27,27,86,'Voluptas qui explicabo ut id. Delectus corporis qui ratione exercitationem reprehenderit neque. Ut error praesentium exercitationem veritatis veniam voluptas esse enim.',0,0,'1980-09-23 09:15:54'),(28,28,18,'Iste non accusamus necessitatibus enim nihil. Ducimus quaerat officiis quo quam. Fugiat quos minima laboriosam recusandae labore.',0,1,'1981-10-17 10:23:45'),(29,29,28,'Illum nobis veritatis doloribus. Aliquam ab sint ducimus consequatur ut qui. Unde ut molestias provident consequatur. Voluptatibus iste distinctio ut voluptas aliquam reprehenderit ducimus.',0,1,'1987-08-20 13:36:58'),(30,30,26,'Ratione qui voluptas ex et nihil quia inventore. Et eius exercitationem excepturi fugiat a qui qui ut. Nemo non ut dolore numquam quia placeat ut. Aut dolores voluptas magni aut sunt voluptates quidem et.',0,0,'1995-10-12 18:48:43'),(31,31,97,'Maxime magni totam sit rerum numquam odio accusantium. Qui neque et et quia.',0,1,'2010-05-10 17:53:08'),(32,32,13,'Tempore voluptatem aperiam ab nostrum. Facilis nulla impedit explicabo voluptatem. Esse sit aut repudiandae quisquam.',1,0,'1988-09-10 09:00:41'),(33,33,4,'Repudiandae eos omnis aut ut veritatis. Facere voluptate inventore ut. Veniam ducimus suscipit aut perferendis cumque cumque dolorem.',1,1,'1974-11-22 06:30:08'),(34,34,5,'Atque aliquid non nostrum vitae at sint rerum. Veniam et consequatur est odio nulla eaque. Nam vitae rerum eveniet excepturi occaecati dolor sint.',1,0,'1981-01-07 05:01:58'),(35,35,77,'Id ea fuga doloremque qui incidunt amet illo. Aut minima et accusantium aut doloribus error voluptatem. Quia quia ratione vel non temporibus ipsam eligendi.',1,0,'2001-03-22 21:57:27'),(36,36,31,'Cupiditate rem autem esse. Voluptatibus et dolor fuga quaerat ad eum. Cumque recusandae voluptas at minima.',0,1,'2012-09-22 00:52:01'),(37,37,69,'Eum magni eaque quam. Ipsum amet est autem sed dolores est. Debitis enim doloribus dolor adipisci.',1,1,'2007-03-22 01:10:41'),(38,38,68,'Cumque rerum sit corrupti. Enim et a aperiam numquam. Ut excepturi quasi asperiores enim. Mollitia est tenetur non quo iure.',0,0,'1973-02-25 15:06:33'),(39,39,5,'Odio at esse in sint numquam porro harum. Alias sed non autem placeat. Doloribus ut et aperiam commodi.',1,1,'2007-10-14 14:57:00'),(40,40,59,'Magni in voluptatem earum in. Sint tenetur qui voluptatum. Qui qui non itaque tempore et magnam.',1,1,'1998-08-19 08:28:14'),(41,41,75,'Perferendis itaque eum labore maiores aliquam. Impedit quis ut est ipsam fugit sit. Fugiat minima voluptas porro magnam beatae.',0,1,'1983-04-30 05:36:04'),(42,42,43,'Dolorem ab sit nihil praesentium. Aperiam repellendus est dolorem sunt non. Quam rem eligendi fuga dolor id aperiam rerum repellat.',0,0,'1999-01-10 11:09:30'),(43,43,32,'Sit maxime perspiciatis molestias eum neque voluptatem a. Delectus non enim vel ea aspernatur. Placeat ut soluta eos voluptatem et consequatur cum dicta. Saepe est placeat facilis aut beatae aspernatur.',1,0,'2007-12-15 17:16:17'),(44,44,72,'Repudiandae fuga est quo ex eveniet est natus eveniet. Modi nesciunt sed a nisi consequatur occaecati quasi distinctio. Voluptas amet quibusdam ut similique fugit magnam. Voluptas nesciunt soluta ut odio nostrum.',1,0,'2008-08-08 18:00:03'),(45,45,16,'Repudiandae totam delectus reiciendis asperiores dolores tempore sunt. Doloremque sit non doloremque ad. Aliquam dignissimos et at sit occaecati eius magnam. Accusantium officiis ipsa eligendi incidunt.',0,0,'2003-02-09 20:58:22'),(46,46,11,'Facilis fuga maxime ipsam facilis quae quod. Qui aliquam ipsa laboriosam sequi consequatur harum rerum. Minima error temporibus molestiae nihil et. Assumenda vero itaque voluptatem eum.',0,1,'1989-11-24 23:40:58'),(47,47,16,'Est vitae quo corrupti possimus amet dignissimos. Natus est numquam in ut qui provident. Laborum distinctio perferendis aut rerum. Non corporis voluptas quia blanditiis quo totam.',0,1,'2019-01-19 12:14:04'),(48,48,64,'Quas omnis et eum quisquam iusto rerum voluptatibus necessitatibus. Possimus facere asperiores necessitatibus voluptatem voluptatibus consequatur ut. Quibusdam et quis velit fuga vero.',1,1,'2020-07-12 23:35:27'),(49,49,72,'Alias amet eos magnam aut. Cum dolorum aut ipsam exercitationem ipsum maiores. Qui a est illum odio.',1,0,'1989-06-09 03:35:14'),(50,50,53,'Odit est quisquam tempora. Laborum aspernatur earum sapiente iste dolores voluptas autem. Vero cum enim in eum reprehenderit quod nesciunt. Fugit dolorum id saepe et eos enim eveniet voluptatem.',0,0,'1976-10-31 23:26:10'),(51,51,43,'Aliquid fuga dolorem sequi. Natus quod quia dolores aut voluptas. Cum labore ut velit quo nemo exercitationem.',1,1,'1978-12-23 20:06:11'),(52,52,99,'Ea sapiente veniam nisi impedit minima odit sapiente. Rem voluptatum veritatis minus. Vel pariatur voluptatibus voluptatem eos sapiente accusantium cumque.',1,1,'1970-02-07 18:59:39'),(53,53,53,'Iure officia excepturi tempore ex. Laboriosam incidunt veritatis doloribus possimus molestiae. Provident mollitia natus consectetur nulla amet. Eaque dignissimos odio ut perspiciatis.',1,0,'1993-09-04 09:02:17'),(54,54,96,'Distinctio illo quae placeat nihil ratione nemo iste. Ipsam maiores amet perferendis omnis ratione placeat eos dolores.',0,1,'1970-05-14 11:36:51'),(55,55,63,'Rerum ea consequuntur dolores ut sequi. Odit non illum quia optio illo. Dolorem a qui dolorum nostrum.',1,0,'2001-07-11 16:24:39'),(56,56,99,'Id fugit distinctio aliquam unde exercitationem fugiat. Voluptates et illo voluptatem ducimus explicabo. Explicabo doloribus aut sed quos consectetur minima ducimus.',0,0,'1984-01-18 21:35:39'),(57,57,88,'Cupiditate reprehenderit aliquam nihil labore. Dolor harum eum perferendis omnis sunt pariatur tempora. Saepe id eos eum et. Doloribus ullam voluptas in qui inventore.',0,0,'1979-06-13 08:00:21'),(58,58,48,'Ipsa vero minus porro et sequi totam cupiditate. Sed omnis exercitationem consequatur quidem est vel odit. Vero incidunt nihil harum fugit dolor temporibus ab blanditiis. Maxime veritatis sed iste doloribus.',1,0,'1978-11-18 13:59:26'),(59,59,16,'Magnam asperiores ut qui voluptates praesentium. Sunt et unde molestiae qui cupiditate ipsam. Culpa sunt similique non ea est quos. Quaerat optio optio ducimus architecto et voluptatem asperiores.',0,0,'2007-09-22 05:10:51'),(60,60,15,'Beatae veritatis unde voluptas. Vero similique eligendi omnis. Eum quia debitis possimus non rerum neque. Ut ea rem id sint.',1,1,'1992-11-27 21:47:01'),(61,61,74,'Ut quam cum hic quae qui qui aut autem. Occaecati maxime dolores suscipit aliquid est ea numquam. Quam consequatur qui quos officia voluptatem. Est autem quo cupiditate et laborum non.',1,1,'1999-09-28 06:46:45'),(62,62,12,'Iste aut quaerat dolore velit aut. Aut quia eligendi explicabo repudiandae enim et. Enim fuga sit est culpa maxime neque. Aut aut veniam est corporis.',1,0,'1980-07-01 08:49:53'),(63,63,28,'Reprehenderit dolor quos et odit consectetur quia eaque. Voluptate velit voluptatibus dolor commodi et qui quod. Perspiciatis et hic autem ipsa aut laboriosam. Dolorum tempora quia adipisci perspiciatis assumenda omnis fugit nostrum.',0,1,'1993-06-26 07:59:25'),(64,64,78,'Nulla corporis quae sequi aut alias. Accusamus consequatur dolorem accusantium expedita fugiat voluptates. Optio officia dolorum neque itaque.',1,0,'2002-12-01 20:44:40'),(65,65,17,'Mollitia ut quis non aperiam temporibus et. Ut sequi et rerum ut iste ut tempora ex. Ut voluptatem omnis adipisci. Magnam praesentium tempora ut cumque est impedit.',0,0,'1996-07-17 00:28:02'),(66,66,4,'Commodi sunt pariatur recusandae et voluptatibus et reiciendis. Odio asperiores dolore eos et ut rerum sed. Similique amet ut dolor nisi atque voluptatem. Fugiat qui hic dicta.',1,1,'1982-05-04 09:14:59'),(67,67,8,'Qui in nulla molestiae ratione cum laboriosam rerum quis. Rerum labore quaerat dolorum tenetur minus minima. Numquam nam non eaque ipsum.',1,1,'1999-10-27 13:45:03'),(68,68,85,'Repellendus veniam mollitia quia tenetur aut omnis ut. Et id nihil expedita voluptatibus molestiae qui quae. Quo fugit labore laudantium dolor et veritatis qui non.',0,1,'1990-01-17 16:08:20'),(69,69,72,'Qui quas nostrum et nihil. Rem nobis eos ut doloribus quam minima.',0,0,'1999-05-21 09:12:58'),(70,70,12,'Autem aut expedita quis fugiat natus. Voluptatem consequuntur accusantium velit error consequuntur molestiae fugit omnis. Sit hic quaerat commodi laborum enim aut.',1,0,'1972-07-06 14:10:49');
/*!40000 ALTER TABLE `messages` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `profile_statuses`
--

DROP TABLE IF EXISTS `profile_statuses`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `profile_statuses` (
  `id` int unsigned NOT NULL AUTO_INCREMENT COMMENT 'Идентификатор строки',
  `name` varchar(30) NOT NULL COMMENT 'Название статуса',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT 'Время создание строки',
  `update_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT 'Время обновления строки',
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='Статусы профилей';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `profile_statuses`
--

LOCK TABLES `profile_statuses` WRITE;
/*!40000 ALTER TABLE `profile_statuses` DISABLE KEYS */;
INSERT INTO `profile_statuses` VALUES (1,'active','2020-10-22 14:35:47','2020-10-22 14:35:47'),(2,'pending','2020-10-22 14:35:47','2020-10-22 14:35:47'),(3,'disable','2020-10-22 14:35:47','2020-10-22 14:35:47');
/*!40000 ALTER TABLE `profile_statuses` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `profiles`
--

DROP TABLE IF EXISTS `profiles`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `profiles` (
  `user_id` int unsigned NOT NULL COMMENT 'Идентификатор строки',
  `gender` enum('m','f') COLLATE utf8_unicode_ci NOT NULL,
  `birthday` date DEFAULT NULL COMMENT 'Дата рождения',
  `photo_id` int unsigned DEFAULT NULL COMMENT 'Ссылка на основную фотографию пользователя',
  `status_id` int unsigned NOT NULL COMMENT 'Идентификатор статуса',
  `city_id` int unsigned DEFAULT NULL,
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT 'Время создания строки',
  `update_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT 'Время обновления строки',
  PRIMARY KEY (`user_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='Профили';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `profiles`
--

LOCK TABLES `profiles` WRITE;
/*!40000 ALTER TABLE `profiles` DISABLE KEYS */;
INSERT INTO `profiles` VALUES (1,'m','2006-07-11',39,1,70,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(2,'f','2012-06-08',87,2,100,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(3,'f','1985-04-08',18,1,89,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(4,'f','2020-01-12',29,3,45,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(5,'m','1995-01-26',90,2,59,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(6,'m','1999-04-24',62,1,60,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(7,'f','1971-07-01',39,1,22,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(8,'f','1993-06-04',8,3,28,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(9,'f','1999-07-23',23,1,73,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(10,'m','1971-07-10',89,3,84,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(11,'m','1994-03-18',75,1,97,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(12,'f','1972-03-28',8,2,33,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(13,'m','1975-06-13',17,1,74,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(14,'m','1995-11-26',59,1,70,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(15,'m','2007-07-29',43,1,27,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(16,'m','1979-09-24',38,1,26,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(17,'f','1993-04-13',59,1,49,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(18,'m','2000-04-15',83,1,67,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(19,'f','2006-06-24',35,1,85,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(20,'f','1980-12-04',28,1,23,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(21,'f','2016-04-07',34,1,60,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(22,'f','1990-10-30',87,1,31,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(23,'f','1970-02-01',31,1,76,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(24,'f','1979-10-07',96,1,86,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(25,'f','1983-07-04',83,1,3,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(26,'m','1970-01-25',29,1,56,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(27,'f','1977-08-05',96,1,71,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(28,'m','1983-11-01',91,1,85,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(29,'f','1988-12-04',68,1,11,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(30,'f','1985-11-25',67,3,99,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(31,'f','1987-02-13',29,1,61,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(32,'m','2020-04-30',43,1,10,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(33,'m','1978-10-17',29,1,66,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(34,'f','1990-09-22',17,2,100,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(35,'m','2006-09-19',96,1,99,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(36,'m','2009-10-30',29,1,95,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(37,'f','2015-12-01',58,3,79,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(38,'f','2014-10-04',2,1,8,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(39,'f','1981-07-10',37,1,4,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(40,'f','1997-11-11',76,1,97,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(41,'m','1972-10-03',67,1,70,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(42,'f','1978-07-21',9,1,60,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(43,'m','1980-04-30',43,1,91,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(44,'m','1987-12-10',88,1,72,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(45,'m','2004-06-05',12,2,86,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(46,'m','1980-09-06',93,1,16,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(47,'f','1992-02-21',31,1,21,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(48,'m','2000-03-16',75,3,58,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(49,'m','1991-07-03',80,1,23,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(50,'m','2020-02-26',74,1,42,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(51,'f','2011-09-19',29,1,41,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(52,'m','1976-04-26',24,1,77,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(53,'m','2014-04-28',32,1,60,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(54,'f','1982-04-13',88,1,71,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(55,'m','2016-11-29',42,1,73,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(56,'m','1979-05-11',46,1,53,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(57,'m','1976-06-24',2,1,43,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(58,'f','2004-05-27',72,1,58,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(59,'m','2009-02-11',52,1,58,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(60,'f','1989-05-11',46,3,19,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(61,'f','2002-11-26',73,1,17,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(62,'f','1994-04-28',25,1,29,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(63,'f','2000-10-24',7,1,91,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(64,'m','2010-12-04',61,1,70,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(65,'f','1974-11-17',82,2,77,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(66,'f','1970-01-05',26,1,74,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(67,'f','2015-07-02',84,3,40,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(68,'m','2003-05-25',41,1,77,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(69,'m','1999-10-29',54,1,65,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(70,'m','1985-08-02',45,1,94,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(71,'f','2018-05-27',64,1,74,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(72,'m','1992-06-17',84,1,89,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(73,'f','2010-10-18',28,1,20,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(74,'m','1999-09-28',86,1,32,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(75,'m','2011-06-01',47,1,100,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(76,'m','2006-07-04',74,1,5,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(77,'f','2003-12-14',31,1,22,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(78,'f','2016-02-17',32,1,94,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(79,'m','2012-06-26',68,1,6,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(80,'m','1988-06-02',43,3,47,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(81,'f','2004-03-21',9,1,17,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(82,'f','1981-07-09',18,1,44,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(83,'f','1988-05-13',61,1,66,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(84,'m','2017-03-30',53,1,99,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(85,'f','1989-01-13',79,1,96,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(86,'m','1996-02-24',34,1,82,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(87,'m','1985-03-25',35,2,22,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(88,'m','1994-06-04',72,1,63,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(89,'f','1991-02-19',53,1,49,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(90,'m','1995-08-26',50,3,55,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(91,'f','2018-12-06',92,1,29,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(92,'f','1991-05-12',6,3,80,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(93,'f','1994-08-08',57,2,11,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(94,'m','1995-01-19',65,1,14,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(95,'f','1991-09-06',52,1,38,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(96,'f','2013-09-19',65,1,46,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(97,'f','1982-10-19',67,1,16,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(98,'f','1970-06-08',42,1,42,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(99,'f','1981-09-13',6,2,62,'2020-10-22 14:23:11','2020-10-22 15:21:14'),(100,'m','1977-02-16',5,1,85,'2020-10-22 14:23:11','2020-10-22 15:21:14');
/*!40000 ALTER TABLE `profiles` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `relative_statuses`
--

DROP TABLE IF EXISTS `relative_statuses`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `relative_statuses` (
  `id` int unsigned NOT NULL AUTO_INCREMENT COMMENT 'Идентификатор строки',
  `name` varchar(150) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'Название статуса',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT 'Время создание строки',
  `update_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT 'Время обновления строки',
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='Статус родственности';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `relative_statuses`
--

LOCK TABLES `relative_statuses` WRITE;
/*!40000 ALTER TABLE `relative_statuses` DISABLE KEYS */;
INSERT INTO `relative_statuses` VALUES (1,'relative','1973-12-18 15:41:23','2006-12-09 13:34:09'),(2,'not a relative','2012-03-06 23:04:41','1977-03-07 14:43:52');
/*!40000 ALTER TABLE `relative_statuses` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `users` (
  `id` int unsigned NOT NULL AUTO_INCREMENT COMMENT 'Идентификатор строки',
  `first_name` varchar(100) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'Имя пользователя',
  `last_name` varchar(100) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'Фамилия пользователя',
  `email` varchar(150) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'Почта',
  `phone` varchar(20) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'Телефон',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT 'Время создание строки',
  `update_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT 'Время обновления строки',
  PRIMARY KEY (`id`),
  UNIQUE KEY `email` (`email`),
  UNIQUE KEY `phone` (`phone`)
) ENGINE=InnoDB AUTO_INCREMENT=101 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='Пользователи';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES (1,'Amy','Carroll','schumm.jordan@example.org','084.490.4927x8237','1995-08-15 10:07:41','2009-12-13 01:48:34'),(2,'Kiara','Bernhard','stanton.dallas@example.org','769-664-3708','2010-02-20 19:38:59','2020-10-22 14:14:24'),(3,'Rubie','Wehner','lgraham@example.net','598-779-1933','1971-07-29 21:05:48','2000-10-27 08:57:56'),(4,'Walter','Simonis','jjacobi@example.net','096.273.5577','1987-09-20 09:08:30','1996-07-11 13:58:02'),(5,'Horacio','Hessel','becker.myles@example.org','353-799-9240','2006-01-10 04:17:45','2020-10-22 14:14:24'),(6,'Shana','Blick','richard.thiel@example.com','1-350-017-8358','1980-08-16 23:48:31','2006-05-08 13:47:54'),(7,'Sienna','Fritsch','newton54@example.net','+36(5)4749776325','1972-08-14 06:50:16','2020-10-22 14:14:24'),(8,'Percival','Cassin','terence.jacobson@example.net','096-753-0345x1576','2017-04-13 21:30:36','2020-10-22 14:14:24'),(9,'Corine','Connelly','michale13@example.net','074-343-4469x633','1984-12-26 07:15:18','2001-06-20 02:29:13'),(10,'Grayce','Mitchell','simone.rogahn@example.org','1-754-381-6233x0707','2001-10-21 11:34:39','2009-07-17 23:17:40'),(11,'Junius','Smith','gwintheiser@example.com','(150)175-0582x961','1990-06-21 23:18:37','2020-10-22 14:14:24'),(12,'Percival','Kiehn','ymorar@example.net','873-238-5203x6882','1991-12-12 12:41:39','2020-10-22 14:14:24'),(13,'Oswaldo','Braun','llittel@example.com','01545346220','1971-09-11 21:36:06','1975-01-12 19:46:59'),(14,'Emmanuelle','Doyle','balistreri.virginie@example.org','287.008.4208x685','2004-06-06 20:02:38','2007-01-27 02:52:26'),(15,'Arely','Cronin','elias.stroman@example.net','+49(3)3004085911','1982-02-07 11:32:43','2016-09-13 04:34:48'),(16,'Anne','Wiza','vgutmann@example.com','1-663-927-2193x81405','1975-08-11 05:17:49','1979-05-05 21:03:18'),(17,'Samantha','Johnston','anderson.kris@example.com','(145)769-6284x40503','2008-11-29 18:16:04','2018-08-21 08:02:27'),(18,'Andreanne','Schneider','ana08@example.net','1-501-556-5574','2002-02-27 07:15:41','2020-10-22 14:14:24'),(19,'Rose','Howell','jeanie.white@example.net','199.581.8070x199','1997-04-02 05:55:36','2020-10-22 14:14:24'),(20,'Matilde','Stark','pagac.marilyne@example.net','443.001.7194x4133','2007-04-20 09:43:52','2020-10-22 14:14:24'),(21,'Aiden','Frami','arvid33@example.org','03401984393','1976-12-07 16:33:42','1989-06-06 11:16:04'),(22,'Rickey','Johnson','cruz23@example.net','(941)879-5346x488','1990-04-09 14:24:32','2020-10-22 14:14:24'),(23,'Sigrid','Glover','whirthe@example.com','(891)564-9241','1987-10-11 01:52:26','1992-04-06 21:18:45'),(24,'Amira','Satterfield','xavier00@example.com','(278)980-4018','2000-05-02 22:51:19','2016-07-13 13:58:51'),(25,'Kylie','Prosacco','little.jazmyn@example.net','04685348725','1980-11-19 16:33:19','1993-12-17 06:38:16'),(26,'Hannah','Schamberger','rschroeder@example.org','953-376-3416x5834','1997-07-11 18:34:23','2020-10-22 14:14:24'),(27,'Herman','Hintz','raphaelle.buckridge@example.org','(511)016-2353x3665','1971-06-18 21:51:35','1984-01-20 02:37:06'),(28,'Providenci','Kerluke','kirlin.ima@example.org','+18(8)0706446762','2008-10-04 05:51:36','2020-10-22 14:14:24'),(29,'Barry','Adams','gsipes@example.com','550.799.3548x41461','2002-04-14 17:41:27','2020-10-22 14:14:24'),(30,'Rosie','Swaniawski','mac97@example.net','00268927268','2013-03-07 11:41:33','2020-10-22 14:14:24'),(31,'Domenick','Kilback','gus.lemke@example.org','03904279993','1973-06-18 16:07:11','2018-01-22 07:46:10'),(32,'Ford','Koss','ylarkin@example.com','(533)201-0409','2006-04-30 08:55:41','2020-10-22 14:14:24'),(33,'Skylar','Bechtelar','stracke.wava@example.org','1-785-729-6612x321','1997-02-06 22:28:41','2020-10-22 14:14:24'),(34,'Wilburn','Hartmann','leda.gleason@example.net','603-380-7386x46510','2018-08-24 20:57:23','2020-10-22 14:14:24'),(35,'Rey','Raynor','gutmann.lazaro@example.net','1-778-138-2475','2020-03-22 12:35:29','2020-10-22 14:14:24'),(36,'Jaylon','Glover','vivian.block@example.org','+17(8)3772472231','1988-10-29 10:26:40','2010-12-17 13:28:01'),(37,'Annamarie','Medhurst','gleuschke@example.com','219.237.7520','2006-03-26 05:33:31','2020-10-22 14:14:24'),(38,'Delfina','Funk','zrunte@example.com','(203)844-5377','2004-08-01 21:58:19','2020-10-22 14:14:24'),(39,'Delaney','Bartell','eo\'conner@example.com','00461465993','1970-11-27 08:30:18','1990-07-23 09:58:36'),(40,'Carmelo','Sauer','laufderhar@example.com','(135)330-8886x5422','1986-05-22 17:26:54','2008-02-05 20:45:51'),(41,'Obie','Blanda','johnson.jadyn@example.net','(360)693-9231x04841','2014-06-04 04:15:06','2020-10-22 14:14:24'),(42,'Lillie','Schamberger','kihn.jo@example.net','00688500644','2002-03-23 16:24:34','2020-10-22 14:14:24'),(43,'Emmanuelle','Gusikowski','kira.reynolds@example.net','1-114-750-2479x1468','2007-03-17 15:38:13','2020-10-22 14:14:24'),(44,'Anais','Denesik','hodkiewicz.norris@example.org','1-822-655-5020x6143','1998-09-04 10:47:09','2020-10-22 14:14:24'),(45,'Justus','Wolf','mayer.lee@example.com','537.131.2137x4890','2008-09-21 10:21:56','2013-10-14 09:59:32'),(46,'Adeline','Stiedemann','kelli.mckenzie@example.net','1-804-490-3382','2016-05-21 21:43:35','2020-10-22 14:14:24'),(47,'Richmond','Sauer','upton.barbara@example.com','560-397-5369','1978-09-02 01:17:57','2020-10-22 14:14:24'),(48,'Rosa','Schmitt','alexandro.armstrong@example.com','1-303-643-9104x52580','2017-09-21 22:24:58','2020-10-22 14:14:24'),(49,'Melba','Doyle','dwindler@example.org','(935)314-6756','1972-02-22 20:18:24','1972-06-15 02:00:14'),(50,'Augusta','Runolfsdottir','jarvis18@example.org','1-846-361-5531x9320','2000-01-01 03:56:58','2010-12-08 16:49:21'),(51,'Patience','Koss','davis.carolanne@example.net','1-799-138-1145x420','1982-08-04 10:33:32','1995-09-04 18:36:09'),(52,'Dejah','Fadel','sandra.ondricka@example.net','1-183-333-0908','1974-03-22 09:22:32','2018-08-21 19:27:33'),(53,'Coty','Zemlak','schneider.vena@example.net','1-446-560-9848x97454','2007-07-05 04:55:52','2019-02-12 19:29:58'),(54,'Gaylord','Crist','amara57@example.com','+10(7)5191969496','1982-02-10 20:20:16','2001-10-12 23:33:46'),(55,'Orlando','Olson','reichert.harvey@example.org','1-477-914-4507x018','1974-08-11 13:39:05','2004-05-10 18:19:41'),(56,'June','Howell','witting.ron@example.org','+81(8)0945949992','2000-05-10 22:05:26','2019-06-14 22:43:26'),(57,'Jada','Koelpin','wilfred.hane@example.org','472-624-2239x728','1990-04-27 19:42:55','2011-12-20 04:56:48'),(58,'Adam','Halvorson','macey.mayert@example.org','(306)158-1303','1973-02-05 13:21:41','1994-06-24 15:09:15'),(59,'Camden','Mitchell','shields.green@example.com','(365)589-4899','1986-07-16 22:16:44','2016-11-13 11:37:18'),(60,'Giuseppe','Gleichner','pasquale05@example.com','059-183-5950x8844','2008-09-19 03:17:20','2012-06-11 00:41:39'),(61,'Jermaine','Harber','hassie.spinka@example.com','280.102.2911','2002-06-04 06:15:24','2020-10-22 14:14:24'),(62,'Melyssa','Labadie','hkshlerin@example.com','1-186-680-2620','1984-12-06 05:35:49','2020-10-22 14:14:24'),(63,'Zaria','Von','tstokes@example.org','(548)387-8123x530','2012-10-16 04:08:06','2020-10-22 14:14:24'),(64,'Stone','Trantow','presley.schmidt@example.net','846.192.8803','2019-03-25 22:33:43','2020-10-22 14:14:24'),(65,'Geraldine','Huel','hollie.leuschke@example.com','(266)596-2841x6182','2020-03-20 19:49:47','2020-10-22 14:14:24'),(66,'Hank','Mills','elinore42@example.org','(011)062-3229','2006-01-05 06:12:03','2012-09-30 08:05:30'),(67,'Lenora','Wunsch','candice.leuschke@example.com','579-339-3358','2011-11-21 14:21:15','2020-10-22 14:14:24'),(68,'Alice','O\'Hara','howell.martin@example.net','(047)022-3063','2004-06-14 03:39:52','2020-10-22 14:14:24'),(69,'Verona','Cruickshank','isabell.zulauf@example.org','592.927.1144','1970-12-21 05:02:16','1988-08-30 20:31:00'),(70,'Arielle','Wolf','xwilliamson@example.net','621-654-4605x942','1983-02-09 21:40:33','2020-10-22 14:14:24'),(71,'Ashton','Smith','tromp.gladys@example.org','454-607-6397x4281','2008-08-04 01:03:35','2020-10-22 14:14:24'),(72,'Torrance','Prohaska','jalon.wiegand@example.org','+67(8)1004980650','2010-03-15 16:11:34','2020-10-22 14:14:24'),(73,'Amber','Legros','tgrady@example.org','427.229.7556x148','2007-01-27 12:00:51','2020-10-22 14:14:24'),(74,'Rhianna','Kuphal','jacobs.delpha@example.org','739.928.5754x805','2019-10-04 17:41:42','2020-10-22 14:14:24'),(75,'Tristin','Satterfield','wfisher@example.com','1-894-940-1624x7930','1988-05-30 00:57:50','1996-10-27 22:54:25'),(76,'Anissa','Rau','xterry@example.net','1-928-053-4237x701','1986-01-11 21:36:40','2020-10-22 14:14:24'),(77,'Carole','Gusikowski','frederick20@example.com','(525)958-8966x1845','1986-01-26 14:05:45','2020-10-22 14:14:24'),(78,'Morton','Deckow','jaylan12@example.net','797.253.7400x17101','1986-01-31 22:19:53','2013-10-30 07:19:32'),(79,'River','McKenzie','nschuppe@example.org','805-011-9280x95268','2016-12-23 04:59:45','2020-10-22 14:14:24'),(80,'Ramon','Schowalter','lshields@example.com','1-161-171-1067','2008-10-12 10:42:15','2020-10-22 14:14:24'),(81,'Ayden','Heller','dsauer@example.net','1-966-039-5342','1991-02-09 21:32:56','2020-10-22 14:14:24'),(82,'Marisol','Hahn','gaylord.willie@example.com','(049)393-4305','1989-02-13 21:02:36','2013-02-22 16:59:54'),(83,'Dudley','Bogisich','block.pinkie@example.org','1-916-273-1249x258','2004-11-07 13:42:20','2020-10-22 14:14:24'),(84,'Erik','Klocko','clemmie91@example.com','1-144-350-2067x80016','1992-04-01 21:09:08','2008-01-31 02:51:27'),(85,'Erika','Reichel','ssenger@example.org','640.338.7734','2000-07-17 08:55:03','2017-05-06 18:57:48'),(86,'Adrianna','Koelpin','wilderman.colt@example.com','291-457-8045x900','1971-07-30 19:34:36','1971-10-26 02:06:29'),(87,'Claudine','McDermott','julie59@example.org','285.732.4117x7372','2009-03-23 09:38:30','2020-10-22 14:14:24'),(88,'Jordan','Labadie','reilly.leannon@example.net','318-565-4706','1994-07-13 06:17:06','2004-03-28 22:29:25'),(89,'Keara','Dickinson','prowe@example.com','609.811.1755','1979-09-13 04:26:41','1989-05-31 21:31:11'),(90,'Erich','Kerluke','csanford@example.org','1-262-041-6282x08247','1972-01-20 02:46:15','1978-02-09 07:51:48'),(91,'Kraig','Boyer','nmitchell@example.com','1-471-508-7469x881','2009-06-18 20:42:00','2020-10-22 14:14:24'),(92,'Vernon','Rempel','einar.stamm@example.org','106.634.1230x1740','1997-11-05 20:22:27','2007-12-27 03:46:34'),(93,'Rasheed','Schiller','lorine28@example.org','1-584-849-1991x40796','1979-12-07 18:03:59','2011-10-23 03:27:47'),(94,'Shanny','Armstrong','hailee.welch@example.org','1-602-813-0545','2001-05-20 23:46:10','2020-10-22 14:14:24'),(95,'Keely','Emmerich','lemke.daniela@example.com','156-944-0484','1974-05-14 18:21:05','1976-12-16 18:41:55'),(96,'Nikita','Corwin','mcdermott.alessandra@example.net','320.681.6002','2000-07-25 02:30:08','2009-06-05 03:52:36'),(97,'Bonnie','Swaniawski','goldner.ambrose@example.net','632.303.1604','2009-02-06 03:08:18','2020-10-22 14:14:24'),(98,'Richard','Haley','sleffler@example.com','172.580.6668','2009-02-20 03:52:20','2020-10-22 14:14:24'),(99,'Danyka','Hackett','wiegand.lily@example.net','819-081-1232','1986-04-21 09:36:30','2008-08-06 20:42:34'),(100,'Haylee','Ortiz','howell.lemke@example.com','(974)994-8729x657','2014-11-21 20:06:06','2020-10-22 14:14:24');
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping routines for database 'vk'
--
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-10-23  0:27:14
